Repository: feveal/gcodekit5
Catalog: po/*.po
Languages: es

source: About
es: Acerca de

source: Connect
es: Conectar

source: Copy
es: Copiar

source: Cut
es: Cortar

source: Disconnect
es: Desconectar

source: Documentation
es: Documentación

source: Edit
es: Editar

source: Emergency stop (Ctrl-X)
es: Emergencia Stop (Ctrl-X)

source: Export G-Code...
es: Exportar G-code...

source: Export SVG...
es: Exportar SVG...

source: File
es: Archivo

source: GCode Toolkit for CNC/Laser Machines
es: Kit de herramientas GCode para máquinas CNC/Láser

source: GCodeKit Contributors
es: Tim Hawkins y colaboradores de GCodeKit

source: Help
es: Ayuda

source: Home
es: Inicio

source: Import
es: Importar

source: Machine
es: Máquina

source: New
es: Nuevo

source: Open
es: Abrir

source: Paste
es: Pegar

source: Preferences
es: Preferencias

source: Quit
es: Salir

source: Redo
es: Rehacer

source: Reset
es: Reiniciar

source: Run
es: Ejecutar

source: Save
es: Guardar

source: Save As...
es: Guardar como...

source: Undo
es: Deshacer

source: Machine Control
es: Control de máquina

source: G-Code Editor
es: Editor de G-Code

source: Visualizer
es: Visualizador

source: CAM Tools
es: Herramientas CAM

source: Designer
es: Diseñador

source: Device Config
es: Configuración del dispositivo

source: Device Manager
es: Administrador de dispositivos

source: CNC Tools
es: Herramientas CNC

source: Materials
es: Materiales

source: Device Console
es: Consola del dispositivo

source: Device Info
es: Información del dispositivo

source: Select
es: Seleccionar

source: Rectangle
es: Rectangulo

source: Circle
es: Circulo

source: Line
es: Linea

source: Polyline
es: Polilinea

source: Text
es: Texto

source: Pan
es: Encuadre

source: Triangle
es: Triangulo

source: Polygon
es: Poligono

source: Gear
es: Engranaje

source: Sprocket
es: Piñon

source: Active tool:
es: Herramienta activa:

source: Fast Shapes
es: Formas rapidas

source: Shape Gallery…
es: Galería de formas…

source: Feed (Speed Laser)
es: Alimentación o Velocidad del Laser

source: Feed Rate or Speed Laser
es: Velocidad de alimentación o del Laser

source: Speed (Power Laser)
es: Velocidad o Potencia del Laser

source: Spindle Speed or Power Laser %
es: Velocidad de husillo o Potencia del laser

source: Tool Dia
es: Diam. de herramienta

source: Tool Diameter
es: Diametro de la herramienta

source: Cut Depth
es: Profundidad de corte

source: Target Cut Depth (positive)
es: Profundidad de corte objetivo (positiva)

source: Step Down
es: Pasada

source: Depth per pass
es: Profundidad de pasada

source: Tool Settings…
es: Configuración de Herramientas…

source: Tool Parameters
es: Parametros de la herramienta

source: Stock Width
es: Ancho en bruto

source: Stock material width
es: Ancho del material en bruto

source: Stock Height
es: Alto en bruto

source: Stock material height
es: Alto del material en bruto

source: Stock Thickness
es: Grosor en bruto

source: Stock material thickness
es: Grosor del material en bruto

source: Safe Z Height
es: Altura Z Seguridad

source: Safe height for rapid moves
es: Altura en Z para movimientos rápidos

source: Resolution
es: Resolucion

source: Simulation resolution (lower = more detail)
es: Resolución de simulación (menor = mayor detalle)

source: Show Stock Removal
es: Mostrar eliminacion de material

source: Stock Settings…
es: Configuración del material en bruto…

source: Stock Settings
es: Configuración del material en bruto

source: Close
es: Cerrar

source: Stock Parameters
es: Parametros en bruto

source: Generate G-Code
es: Generar G-Code

source: View Controls
es: Controles de Visualizacion

source: Cancel
es: Cancelar

source: Add
es: Añadir

source: Enter text
es: Introducir Texto

source: Font:
es: Fuente:

source: Size:
es: Tamaño:

source: Style:
es: Estilo:

source: Zoom Out
es: Zoom -

source: Fit to Content
es: Ajustar al contenido

source: Fit to Viewport
es: Ajustar a la ventana

source: Fit to Device Working Area
es: Ajustar al Area de trabajo

source: Toggle Scrollbars
es: Barras de desplazamiento si/no

source: Keyboard Shortcuts
es: Atajos de Teclado

source: Designer shortcuts
es: Atajos de diseño

source: Right click for context menu
es: Boton derecho para menú contextual

source: Zoom In
es: Zoom +

source: No shapes yet
es: No hay formas

source: Use the toolbox on the left to start drawing.
es: Utilice la caja de herramientas de la izquierda para comenzar a dibujar.

source: Load Design
es: Cargar diseño

source: Hide Properties
es: Ocultar Propiedades

source: Hide
es: Ocultar

source: Unhide Properties
es: Mostrar Propiedades

source: Unhide
es: Mostrar

source: Show Grid
es: Mostrar Rejilla

source: Grid spacing
es: Espaciado de Rejilla

source: Snap
es: Ajustar

source: Snap threshold
es: Umbral de ajuste

source: Snap to grid
es: Ajustar a la Rejilla

source: Show Toolpaths
es: Mostrar trayectoria de herramienta

source: Constraint
es: Restriccion

source: G-Code generated
es: G-Code generado

source: New design created
es: Nuevo diseño creado

source: Open Design File
es: Abrir archivo de diseño

source: GCodeKit Design Files
es: Archivos de diseño GCodeKit

source: All Files
es: Todos los archivos

source: Loaded:
es: Cargado:

source: Error loading file:
es: Error cargando archivo:

source: Import Design File
es: Importar Archivo Diseño

source: Supported Files
es: Archivos soportados

source: Imported:
es: Importado:

source: Error importing file:
es: Error importando archivo:

source: Save Design File
es: Guardar archivo diseño

source: Error saving file:
es: Error guardando archivo:

source: Make sure to include the file extension (.nc, .gcode, .gc o .tap)
es: Asegúrese de incluir la extensión del archivo (.nc, .gcode, .gc o .tap)

source: Exported G-Code:
es: G-Code Exportado:

source: Error exporting G-Code:
es: Error exportando G-Code:

source: Nothing to export
es: Nada que exportar

source: Hide Sidebar
es: Ocultar barra lateral

source: 2D View
es: Vista 2D

source: 3D View
es: Vista 3D

source: Mode
es: Modo

source: Show Rapid Moves
es: Ver movimientos rápidos

source: Show Cutting Moves
es: Ver Movimientos de Corte

source: Show Machine Bounds
es: Mostrar límites de la máquina

source: Show Intensity
es: Mostrar intensidad

source: Show Laser/Spindle
es: Mostrar láser/husillo

source: Guides
es: Guías

source: Simulation
es: Simulación

source: No G-code loaded
es: No se ha cargado el G-code

source: Open a file to preview toolpaths.
es: Abra un archivo para vista previa de las trayectorias.

source: Visualizer shortcuts
es: Atajos del visualizador

source: Delete “{}”? This cannot be undone.
es: Borrar "{}"? No se puede deshacer.

source: No ports available
es: No hay puertos disponibles

source: Refresh ports
es: Refrescar puertos

source: Connection
es: Conectado

source: Disconnected
es: Desconectado

source: Feed: -
es: Alim: -

source: Spindle: -
es: Husillo: -

source: Unlock from ALARM ($X)
es: Desbloquear ALARMA ($X)

source: Machine State
es: Estado de la Máquina

source: Work Coordinates
es: Coordenadas de trabajo

source: Send G-code from the editor
es: Enviar G-code desde el editor

source: Stop job: abort streaming (does not reset controller)
es: Detener trabajo: abortar la transmisión (no reinicia el controlador)

source: Pause streaming (!)
es: Pausar transmisión (!)

source: Resume streaming (~)
es: Reanudar transmisión (~)

source: Stop aborts streaming; E‑Stop resets the controller.
es: Detener transmisión; E‑Stop reinicia el controlador.

source: Job Control
es: Control de trabajo

source: Connect to enable controls.
es: Conectarse para habilitar controles.

source: Current Feed & Spindle
es: Alimentación de corriente y husillo

source: Decrease feed rate by 10%
es: Disminuir velocidad un 10%

source: Decrease feed rate by 1%
es: Disminuir velocidad un 1%

source: Reset feed rate to 100%
es: Restablecer velocidad al 100%

source: Increase feed rate by 1%
es: Incrementar velocidad un 1%

source: Increase feed rate by 10%
es: Incrementar velocidad un 10%

source: Work Coordinates (WPos)
es: Coordenadas de trabajo (WPos)

source: Zero
es: Cero

source: Set work axis to zero
es: Poner eje de trabajo a cero

source: Set active work position to 0 for X/Y/Z
es: Establecer posición de trabajo a 0 para X/Y/Z

source: Include Z
es: Incluir Z

source: Jog Feed:
es: Jog:

source: Rapid move to work origin (X/Y, or X/Y/Z if Include Z is checked)
es: Movimiento rápido al origen del trabajo (X/Y, o X/Y/Z si está inlcluido eje Z)

source: When checked, Go to Work Zero will also move to Z0
es: Cuando se marca, Ir a cero incluido también Z0

source: Machine Coordinates (MPos)
es: Coordenadas de Máquina (MPos)

source: Keyboard jog: 8/2/4/6 (XY), 9/3 (Z)
es: Movimiento del teclado: 8/2/4/6 (XY), 9/3 (Z)

source: Emergency stop (soft reset Ctrl-X)
es: Emergencia stop (reinicio suave Ctrl-X)

source: Clear console
es: Limpiar Consola

source: Copy last error
es: Copiar último error

source: Device Console not available
es: Consola del dispositivo no disponible

source: Hide device console
es: Ocultar consola de dispositivo

source: Show Console
es: Mostrar Consola

source: Show device console
es: Mostrar consola de dispositivo

source: No G-Code to Send
es: No hay G-Code para enviar

source: Please load or type G-Code into the editor first.
es: Primero cargue o escriba el G-Code en el editor.

source: Zero All Axes
es: Todos los ejes a Cero

source: Zero all work axes?
es: ¿Poner a cero todos los ejes?

source: Go to Work Zero
es: Llevar trabajo a Cero

source: This sets the active work coordinate system so the current X/Y/Z becomes 0.
es: Esto establece el sistema de coordenadas de trabajo activo para que el X/Y/Z actual pase a ser 0.

source: Port: -
es: Puerto: -

source: State: Disconnected
es: Estado: Desconectado

source: Error disconnecting
es: Error al desconectar

source: Connecting…
es: Conectando…

source: State: Connecting…
es: Estado: Conectando…

source: Connected to
es: Conectado a

source: Controller error
es: Error de Controlador

source: Streaming Completed.
es: Transmisión completada.

source: Job Finished.
es: Trabajo terminado.

source: ALARM: Unlock required.
es: ALARMA: Se requiere desbloqueo.

source: Error connecting
es: Error al conectar

source: No valid G-Code lines found.
es: No se encontraron líneas de G-Code válidas.
